/******************************************************************************
*											
* Copyright (C) 2015, Sunic-ocean
* All Rights Reserved										
*
* 文 件 名： SoftWatchDog.c
* 创建时间： 2015年4月16日14:55:36
* 描    述：软件定时器
*
*******************************************************************************/

#ifndef __SOFTWATCHDOG_H__
#define __SOFTWATCHDOG_H__

#include "DataType.h"
#include "Timer.h"

//软件定时器操作返回状态
#define SWD_STATUS       SINT8
//操作成功
#define SWD_OK           1
//操作失败
#define SWD_ERROR       -1

/******************************************************************************
 * 函数名称：SwdInit
 * 描述： 软件定时器初始化
 *
 * 参数：无
 * 返回：无
 *****************************************************************************/
extern void SwdInit(void);

/******************************************************************************
 * 函数名称：SwdGet
 * 描述： 得到一个可用的软件定时器
 *
 * 参数：无
 * 返回：可用定时器标号
 *****************************************************************************/
extern SINT8 SwdGet(void);

/******************************************************************************
 * 函数名称：SwdSetName
 * 描述： 设置软件定时器的 名称
 *
 * 参数：sDog -- 定时器标号
 *       pName -- 定时器名称

 * 返回：SWD_OK -- 设置成功
 *       SWD_ERROR -- 设置失败
 *****************************************************************************/
extern SWD_STATUS SwdSetName(SINT8 s8Dog, UINT8 *pName);

/******************************************************************************
 * 函数名称：SwdSetLifeTime
 * 描述： 设置软件定时器的初始时间
 *
 * 参数：sDog -- 定时器标号
 *       u16LifeTime -- 定时器的工作时间
 * 返回：SWD_OK -- 设置成功
 *       SWD_ERROR -- 设置失败
 *****************************************************************************/
extern SWD_STATUS SwdSetLifeTime(SINT8 s8Dog, UINT16 u16LifeTime);

/******************************************************************************
 * 函数名称：SwdGetLifeTime
 * 描述： 获取软件定时器的初始时间
 *
 * 参数：sDog -- 定时器标号
 *       u16LifeTime -- 定时器的工作时间
 * 返回：SWD_OK -- 设置成功
 *       SWD_ERROR -- 设置失败
 *****************************************************************************/
extern UINT16 SwdGetLifeTime(SINT8 s8Dog);

/******************************************************************************
 * 函数名称：SwdEnable
 * 描述： 使能指定的软件定时器
 *
 * 参数：sDog -- 定时器标号
 * 返回：SWD_OK -- 设置成功
 *       SWD_ERROR -- 设置失败
 *****************************************************************************/
extern SWD_STATUS SwdEnable(SINT8 s8Dog);

/******************************************************************************
 * 函数名称：SwdIsEnable
 * 描述：指定的软件定时器是否使能
 *
 * 参数：sDog -- 定时器标号
 * 返回：1 -- 使能
 *       0 -- 关闭
 *****************************************************************************/
extern SINT8 SwdIsEnable(SINT8 s8Dog);

/******************************************************************************
 * 函数名称：SwdDisable
 * 描述： 关闭指定的软件定时器
 *
 * 参数：sDog -- 定时器标号
 * 返回：SWD_OK -- 设置成功
 *       SWD_ERROR -- 设置失败
 *****************************************************************************/
extern SWD_STATUS SwdDisable(SINT8 s8Dog);

/******************************************************************************
 * 函数名称：SwdReset
 * 描述： 复位指定的定时器到初始值
 *
 * 参数：sDog -- 定时器标号
 * 返回：SWD_OK -- 设置成功
 *       SWD_ERROR -- 设置失败
 *****************************************************************************/
extern SWD_STATUS SwdReset(SINT8 sDog);

/******************************************************************************
 * 函数名称：SwdFree
 * 描述： 释放指定的软件定时器
 *
 * 参数：sDog -- 定时器标号
 * 返回：SWD_OK -- 设置成功
 *       SWD_ERROR -- 设置失败
 *****************************************************************************/
extern SWD_STATUS SwdFree(SINT8 sDog);

/******************************************************************************
 * 函数名称：SwdRun
 * 描述：运行软件定时器
 *
 * 参数：无
 * 返回：无
 *****************************************************************************/
extern void SwdRun(void);

#endif

