
#ifndef __UART3_H__
#define __UART3_H__

#include "global.h"
#include "DataType.h"


/***************************************************************************
函数名称：Uart3Init()
功    能：UART0初始化，
          配置波特率为9600,8bit data，1bit stop，none verify
参    数：无
返回值  ：无
***************************************************************************/
extern void Uart3Init(void);

/*******************************************
函数名称：Uart3SendByte()
功    能：通过UART1发送一个byte
参    数：u8Data
返回值  ：无
********************************************/
extern void Uart3SendByte(UINT8 u8Data);


/*******************************************
函数名称：Uart3SendString()
功    能：通过UART1发送字符串
参    数：*pString
返回值  ：无
********************************************/
extern void Uart3SendString(UINT8 * pString);

/********************************************************************************
  函数名称：Uart3SendBuffer
  函数功能：发送buffer中u8Length个byte

  参数：*pu8Buf
        u8Lenght   --  发送个数
  返回：无
*********************************************************************************/
extern void Uart3SendBuffer(UINT8 *pu8Buf, UINT8 u8Length);

/***************************************************************************
  函数名称：Uart3EnableInterrupt
  函数功能：使能Uart中断

  参数：无
  返回：无
***************************************************************************/
extern void Uart3EnableInterrupt(void);

/***************************************************************************
  函数名称：Uart3DisableInterrupt
  函数功能：关闭Uart中断

  参数：无
  返回：无
***************************************************************************/
extern void Uart3DisableInterrupt(void);

/***************************************************************************
//函数名称：Uart3GetRxDataLength
//功能描述：从串口缓冲区取得接收长度
//
//参数：无
//返回：u8DataLen
***************************************************************************/
extern UINT16 Uart3GetRxDataLength(void);

/***************************************************************************
//函数名称：Uart3GetByte
//功能描述：从串口缓冲区取得 一个数据
//
//参数：无
//返回：u8RxData
***************************************************************************/
extern UINT8 Uart3GetByte(void);

/***************************************************************************
//函数名称：Uart3GetRxData
//功能描述：从串口缓冲区取得数据
//
//参数：无
//返回：获取数据的长度
***************************************************************************/
extern UINT16 Uart3GetRxData(UINT8 *pu8Buffer, UINT16 u16DataLen);

/***************************************************************************
//函数名称：Uart3EmptyRxBuf
//功能描述：清空接收缓冲区
//
//参数：无
//返回：无
***************************************************************************/
extern void Uart3EmptyRxBuf(void);

#endif