
#ifndef __UART2_H__
#define __UART2_H__

#include "global.h"
#include "DataType.h"


/***************************************************************************
函数名称：Uart2Init()
功    能：UART2初始化，
          配置波特率为9600,8bit data，1bit stop，none verify
参    数：无
返回值  ：无
***************************************************************************/
extern void Uart2Init(void);

/*******************************************
函数名称：Uart2SendByte()
功    能：通过UART2发送一个byte
参    数：u8Data
返回值  ：无
********************************************/
extern void Uart2SendByte(UINT8 u8Data);


/*******************************************
函数名称：Uart2SendString()
功    能：通过UART1发送字符串
参    数：*pString
返回值  ：无
********************************************/
extern void Uart2SendString(const UINT8 * pString);

/********************************************************************************
  函数名称：Uart2SendBuffer
  函数功能：发送buffer中u8Length个byte

  参数：*pu8Buf
        u8Lenght   --  发送个数
  返回：无
*********************************************************************************/
extern void Uart2SendBuffer(const UINT8 *pu8Buf, UINT8 u8Length);

/***************************************************************************
  函数名称：Uart3EnableInterrupt
  函数功能：使能Uart中断

  参数：无
  返回：无
***************************************************************************/
extern void Uart2EnableInterrupt(void);

/***************************************************************************
  函数名称：Uart2DisableInterrupt
  函数功能：关闭Uart中断

  参数：无
  返回：无
***************************************************************************/
extern void Uart2DisableInterrupt(void);

/***************************************************************************
//函数名称：Uart2GetRxDataLength
//功能描述：从串口缓冲区取得接收长度
//
//参数：无
//返回：u8DataLen
***************************************************************************/
extern UINT16 Uart2GetRxDataLength(void);

/***************************************************************************
//函数名称：Uart2GetByte
//功能描述：从串口缓冲区取得 一个数据
//
//参数：无
//返回：u8RxData
***************************************************************************/
extern UINT8 Uart2GetByte(void);

/***************************************************************************
//函数名称：Uart2GetRxData
//功能描述：从串口缓冲区取得数据
//
//参数：无
//返回：获取数据的长度
***************************************************************************/
extern UINT16 Uart2GetRxData(UINT8 *pu8Buffer, UINT16 u16DataLen);

/***************************************************************************
//函数名称：Uart2EmptyRxBuf
//功能描述：清空接收缓冲区
//
//参数：无
//返回：无
***************************************************************************/
extern void Uart2EmptyRxBuf(void);

/***************************************************************************
//函数名称：Uart2RxTimeoutCheck
//功能描述：串口2数据接收超时处理
//
//参数：无
//返回：TRUE--超时，FALSE--没有超时
***************************************************************************/
extern BOOL Uart2RxTimeoutCheck(void);

#endif