

#ifndef __TIMER_H__
#define __TIMER_H__

#ifdef MSP430F149
#include "msp430x14x.h"
#else
#include "msp430x54x.h"
#endif

#include "DataType.h"


/******************************************************************************
 * 函数名称：TimerA_Init
 * 描述：TIMER A init
 *
 * 参数：无
 * 返回：无
 *****************************************************************************/
extern void TimerA_Init(void);

/******************************************************************************
 * 函数名称：SoftTimerInit
 * 函数功能：软件定时器的定时初始化
 *
 * 参数：无
 * 返回：无
 *****************************************************************************/
extern void SoftTimerInit(void);

/******************************************************************************
 * 函数名称：TimerInterruptEnable
 * 描述：使能TIMER A0中断
 *
 * 参数：无
 * 返回：无
 *****************************************************************************/
extern void TimerInterruptEnable(void);

/******************************************************************************
 * 函数名称：TimerInterruptDisable
 * 描述：关闭TIMER A0中断
 *
 * 参数：无
 * 返回：无
 *****************************************************************************/
extern void TimerInterruptDisable(void);

#endif